In [1]:
import sqlite3
import pandas as pd

In [2]:
pd.options.display.max_columns = None
#pd.options.display.max_rows = None

In [3]:
conn = sqlite3.connect('parch-and-posey.db')

In [4]:
cursor = conn.cursor()
cursor.execute('''
select * from sqlite_master where type = "table";
''')
columns = [col[0] for col in cursor.description]
data = cursor.fetchall()
cursor.close()

In [5]:
pd.DataFrame(data, columns=columns)

,type,name,tbl_name,rootpage,sql
0,table,web_events,web_events,2,"CREATE TABLE web_events (\tid integer,\taccoun..."
1,table,sales_reps,sales_reps,7,"CREATE TABLE sales_reps (\tid integer,\tname b..."
2,table,region,region,222,"CREATE TABLE region (\tid integer,\tname bpchar)"
3,table,orders,orders,223,"CREATE TABLE orders (\tid integer,\taccount_id..."
4,table,accounts,accounts,583,"CREATE TABLE accounts (\tid integer,\tname bpc..."

In [6]:
pd.read_sql_query(sql='''
SELECT *
FROM orders;
''', con=conn)

,id,account_id,occurred_at,standard_qty,gloss_qty,poster_qty,total,standard_amt_usd,gloss_amt_usd,poster_amt_usd,total_amt_usd
0,1,1001,2015-10-06 17:31:14,123,22,24,169,613.77,164.78,194.88,973.43
1,2,1001,2015-11-05 03:34:33,190,41,57,288,948.10,307.09,462.84,1718.03
2,3,1001,2015-12-04 04:21:55,85,47,0,132,424.15,352.03,0.00,776.18
3,4,1001,2016-01-02 01:18:24,144,32,0,176,718.56,239.68,0.00,958.24
4,5,1001,2016-02-01 19:27:27,108,29,28,165,538.92,217.21,227.36,983.49
...,...,...,...,...,...,...,...,...,...,...,...
6907,6908,4501,2016-06-29 04:03:39,11,199,59,269,54.89,1490.51,479.08,2024.48
6908,6909,4501,2016-07-29 19:58:32,5,91,96,192,24.95,681.59,779.52,1486.06
6909,6910,4501,2016-08-27 00:58:11,16,94,82,192,79.84,704.06,665.84,1449.74
6910,6911,4501,2016-11-22 06:52:22,63,67,81,211,314.37,501.83,657.72,1473.92
6911,6912,4501,2016-12-21 13:30:42,61,150,52,263,304.39,1123.50,422.24,1850.13

# QUIZ QUESTION

Often there is confusion about the difference between WHERE and HAVING. Select all the statements that are true regarding HAVING and WHERE statements.

WHERE subsets the returned data based on a logical condition.

WHERE appears after the FROM, JOIN, and ON clauses, but before GROUP BY.

HAVING appears after the GROUP BY clause, but before the ORDER BY clause.

HAVING is like WHERE, but it works on logical statements involving aggregations.

Questions: HAVING

Task 1:

How many of the sales reps have more than 5 accounts that they manage?

In [11]:
pd.read_sql_query(sql='''
SELECT s.name, COUNT (*) count
FROM sales_reps s
JOIN accounts a
ON a.sales_rep_id = s.id
GROUP BY s.name
HAVING count > 5
ORDER BY count DESC;
''', con=conn)

                   name  count
0   Georgianna Chisholm     15
1         Vernita Plump     11
2        Micha Woodford     11
3   Maryanna Fiorentino     11
4           Maren Musto     11
5     Earlie Schleusner     11
6       Dorotha Seawell     11
7        Calvin Ollison     11
8             Saran Ram     10
9           Moon Torian     10
10         Hilma Busick     10
11         Brandie Riva     10
12      Arica Stoltzfus     10
13    Marquetta Laycock      9
14         Elwood Shutt      9
15          Dawna Agnew      9
16            Tia Amato      8
17        Julia Behrman      8
18         Delilah Krum      8
19        Soraya Fulton      7
20          Nelle Meaux      7
21      Michel Averette      7
22        Gianna Dossey      7
23        Elna Condello      7
24      Derrick Boggess      7
25         Cliff Meints      7
26      Charles Bidwell      7
27       Babette Soukup      7
28         Sibyl Lauria      6
29        Samuel Racine      6
30       Necole Victory      6
31         Eugena Esser      6
32          Elba Felder      6
33       Debroah Wardle      6

In [86]:
pd.read_sql_query(sql='''
SELECT COUNT(*) num_reps_above5
FROM(SELECT s.id, s.name, COUNT(*) num_accounts
     FROM accounts a
     JOIN sales_reps s
     ON s.id = a.sales_rep_id
     GROUP BY s.id, s.name
     HAVING COUNT(*) > 5
     ORDER BY num_accounts) AS Table1;
''', con=conn)

   num_reps_above5
0               34

Solution:

SELECT s.id, s.name, COUNT(*) num_accounts
FROM accounts a
JOIN sales_reps s
ON s.id = a.sales_rep_id
GROUP BY s.id, s.name
HAVING COUNT(*) > 5
ORDER BY num_accounts;

SELECT COUNT(*) num_reps_above5
FROM(SELECT s.id, s.name, COUNT(*) num_accounts
     FROM accounts a
     JOIN sales_reps s
     ON s.id = a.sales_rep_id
     GROUP BY s.id, s.name
     HAVING COUNT(*) > 5
     ORDER BY num_accounts) AS Table1;

Task 2:

How many accounts have more than 20 orders?

In [87]:
pd.read_sql_query(sql='''
SELECT a.name, COUNT (*) count
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY a.name
HAVING count > 20
ORDER BY count DESC;
''', con=conn)

                                 name  count
0                   Leucadia National     71
1                               Sysco     68
2                           Supervalu     68
3                   Arrow Electronics     67
4                              Mosaic     66
..                                ...    ...
115                          Raytheon     22
116                     Jabil Circuit     22
117  Thrivent Financial for Lutherans     21
118            Performance Food Group     21
119                            Anthem     21

[120 rows x 2 columns]

In [90]:
pd.read_sql_query(sql='''
SELECT COUNT(*) num_accounts_above20
FROM(SELECT a.id, a.name, COUNT(*) num_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
HAVING COUNT(*) > 20
ORDER BY num_orders) AS Table1;
''', con=conn)

   num_accounts_above20
0                   120

Solution:

Task 3:

Which account has the most orders?

In [13]:
pd.read_sql_query(sql='''
SELECT a.name, COUNT (*) count
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY a.name
ORDER BY count DESC
LIMIT 1;
''', con=conn)

                name  count
0  Leucadia National     71

Solution:

SELECT a.id, a.name, COUNT(*) num_orders
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY num_orders DESC
LIMIT 1;

Task 4:

Which accounts spent more than 30,000 usd total across all orders?

In [92]:
# BEWARE OF MISTAKE!!! - total columns in HAVING is in fact o.total!!!

pd.read_sql_query(sql='''
SELECT a.name, SUM(total_amt_usd) total
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY 1
HAVING total > 3000
ORDER BY 2 DESC;
''', con=conn)

     name      total
0  Paccar  161294.62

In [91]:
pd.read_sql_query(sql='''
SELECT a.name, SUM(total_amt_usd) total
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY 1
HAVING o.total > 3000
ORDER BY 2 DESC;
''', con=conn)

     name      total
0  Paccar  161294.62

In [30]:
# THIS IS CORRECT!

pd.read_sql_query(sql='''
SELECT a.name, SUM(total_amt_usd) total_USD
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY 1
HAVING total_USD > 30000
ORDER BY 2 DESC;
''', con=conn)

                        name  total_USD
0              EOG Resources  382873.30
1                     Mosaic  345618.59
2                        IBM  326819.48
3           General Dynamics  300694.79
4          Republic Services  293861.14
..                       ...        ...
199                   Oracle   31231.56
200                   Costco   30741.01
201       Group 1 Automotive   30708.92
202                  PepsiCo   30095.72
203  American Airlines Group   30083.18

[204 rows x 2 columns]

In [96]:
pd.read_sql_query(sql='''
SELECT COUNT(*) num_accounts_above30t
FROM(SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
HAVING SUM(o.total_amt_usd) > 30000
ORDER BY total_spent) AS Table1;
''', con=conn)

   num_accounts_above30t
0                    204

Solution:

SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
HAVING SUM(o.total_amt_usd) > 30000
ORDER BY total_spent;

Task 5:

Which accounts spent less than 1,000 usd total across all orders?

In [94]:
pd.read_sql_query(sql='''
SELECT a.name, SUM(total_amt_usd) total_USD
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY 1
HAVING total_USD < 1000
ORDER BY 2 DESC;
''', con=conn)

                     name  total_USD
0  Level 3 Communications     881.73
1         Delta Air Lines     859.64
2                    Nike     390.25

In [97]:
pd.read_sql_query(sql='''
SELECT COUNT(*) num_accounts_under1t
FROM(SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
HAVING SUM(o.total_amt_usd) < 1000
ORDER BY total_spent) AS Table1;
''', con=conn)

   num_accounts_under1t
0                     3

Solution:

SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
HAVING SUM(o.total_amt_usd) < 1000
ORDER BY total_spent;

Task 6:

Which account has spent the most with us?

In [32]:
pd.read_sql_query(sql='''
SELECT a.name, SUM(total_amt_usd) total_USD
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;
''', con=conn)

            name  total_USD
0  EOG Resources   382873.3

Solution:

SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY total_spent DESC
LIMIT 1;

Task 7:

Which account has spent the least with us?

In [33]:
pd.read_sql_query(sql='''
SELECT a.name, SUM(total_amt_usd) total_USD
FROM orders o
JOIN accounts a
ON o.account_id = a.id
GROUP BY 1
ORDER BY 2
LIMIT 1;
''', con=conn)

   name  total_USD
0  Nike     390.25

Solution:

SELECT a.id, a.name, SUM(o.total_amt_usd) total_spent
FROM accounts a
JOIN orders o
ON a.id = o.account_id
GROUP BY a.id, a.name
ORDER BY total_spent
LIMIT 1;

Task 8:

Which accounts used facebook as a channel to contact customers more than 6 times?

In [42]:
pd.read_sql_query(sql='''
SELECT a.name, COUNT(*) count
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
WHERE w.channel = 'facebook'
GROUP BY 1
HAVING count > 6
ORDER BY 2 DESC;
''', con=conn)

                                   name  count
0                       Gilead Sciences     16
1                                   TJX     15
2                            AutoNation     14
3                Charter Communications     13
4           Philip Morris International     12
5                    Marathon Petroleum     12
6                                Disney     12
7           United Continental Holdings     11
8                                Ecolab     11
9                         EOG Resources     11
10             Walgreens Boots Alliance     10
11              New York Life Insurance     10
12                               Mosaic     10
13                        Lithia Motors     10
14                          FirstEnergy     10
15                    Colgate-Palmolive     10
16                            BlackRock     10
17                                Aetna     10
18                   Southwest Airlines      9
19  Massachusetts Mutual Life Insurance      9
20                        Kinder Morgan      9
21                        General Mills      9
22                       Dollar General      9
23                Cameron International      9
24                           CST Brands      9
25                    Arrow Electronics      9
26                                Apple      9
27                                  ADP      9
28                      PayPal Holdings      8
29                               Paccar      8
30                                  PPL      8
31                     General Dynamics      8
32                                Fluor      8
33                    Core-Mark Holding      8
34                        Cisco Systems      8
35                                 eBay      7
36                          Wells Fargo      7
37                      Parker-Hannifin      7
38                    Leucadia National      7
39          Laboratory Corp. of America      7
40                    J.P. Morgan Chase      7
41              Honeywell International      7
42                           Home Depot      7
43           Farmers Insurance Exchange      7
44                             Best Buy      7
45                    Avis Budget Group      7

In [98]:
pd.read_sql_query(sql='''
SELECT COUNT(*) num_accounts_under1t
FROM(SELECT a.id, a.name, w.channel, COUNT(*) use_of_channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
GROUP BY a.id, a.name, w.channel
HAVING COUNT(*) > 6 AND w.channel = 'facebook'
ORDER BY use_of_channel) AS Table1;
''', con=conn)

   num_accounts_under1t
0                    46

Solution:

SELECT a.id, a.name, w.channel, COUNT(*) use_of_channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
GROUP BY a.id, a.name, w.channel
HAVING COUNT(*) > 6 AND w.channel = 'facebook'
ORDER BY use_of_channel;

Task 9:

Which account used facebook most as a channel?

In [43]:
pd.read_sql_query(sql='''
SELECT a.name, COUNT(*) count
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
WHERE w.channel = 'facebook'
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;
''', con=conn)

              name  count
0  Gilead Sciences     16

Solution:

SELECT a.id, a.name, w.channel, COUNT(*) use_of_channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
WHERE w.channel = 'facebook'
GROUP BY a.id, a.name, w.channel
ORDER BY use_of_channel DESC
LIMIT 1;

Task 10:

Which channel was most frequently used by most accounts?

In [55]:
pd.read_sql_query(sql='''
SELECT a.name, w.channel, COUNT(*) count
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
GROUP BY 1, 2
ORDER BY 3 DESC
LIMIT 50;
''', con=conn)

                               name channel  count
0                 Leucadia National  direct     52
1                 Colgate-Palmolive  direct     51
2           New York Life Insurance  direct     51
3       Philip Morris International  direct     49
4                               ADP  direct     48
5                        AutoNation  direct     48
6                         BlackRock  direct     48
7            Charter Communications  direct     48
8                       FirstEnergy  direct     48
9                      Altria Group  direct     47
10  American Family Insurance Group  direct     47
11                            FedEx  direct     47
12                           Mosaic  direct     47
13                  Western Digital  direct     47
14                Avis Budget Group  direct     46
15                    Cisco Systems  direct     46
16                Core-Mark Holding  direct     46
17                           Ecolab  direct     46
18               Marathon Petroleum  direct     46
19                     DISH Network  direct     45
20                        Supervalu  direct     45
21                Arrow Electronics  direct     44
22                         Best Buy  direct     44
23                           Disney  direct     44
24                    EOG Resources  direct     44
25                 General Dynamics  direct     44
26                         Monsanto  direct     44
27                            Sysco  direct     44
28                              TJX  direct     44
29              United Technologies  direct     43
30         Walgreens Boots Alliance  direct     43
31                            Cigna  direct     42
32                            Fluor  direct     42
33                              IBM  direct     42
34               Southwest Airlines  direct     42
35      United Continental Holdings  direct     41
36                       CST Brands  direct     40
37                      Freddie Mac  direct     40
38         Thermo Fisher Scientific  direct     40
39           Archer Daniels Midland  direct     39
40                          Centene  direct     39
41                          Entergy  direct     39
42                     Land O'Lakes  direct     39
43              United States Steel  direct     39
44                        Citigroup  direct     38
45                Republic Services  direct     37
46                            Aetna  direct     36
47       Farmers Insurance Exchange  direct     36
48                           Paccar  direct     36
49                             AT&T  direct     35

Solution:

SELECT a.id, a.name, w.channel, COUNT(*) use_of_channel
FROM accounts a
JOIN web_events w
ON a.id = w.account_id
GROUP BY a.id, a.name, w.channel
ORDER BY use_of_channel DESC
LIMIT 10;

In [85]:
pd.read_sql_query(sql='''
SELECT channel, COUNT(*) count
FROM(SELECT *
FROM(SELECT a.name, w.channel, COUNT(*) count
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
GROUP BY 1, 2
ORDER BY 3 DESC) AS Table1
GROUP BY name) AS Table2
GROUP BY 1
ORDER BY 2 DESC;
''', con=conn)

    channel  count
0    direct    333
1   adwords     10
2    banner      5
3   organic      2
4  facebook      1

In [84]:
pd.read_sql_query(sql='''
SELECT *
FROM(SELECT a.name, w.channel, COUNT(*) count
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
GROUP BY 1, 2
ORDER BY 3 DESC) AS Table1
GROUP BY name
HAVING channel = 'direct';
''', con=conn)

                    name channel  count
0                     3M  direct     19
1                    ADP  direct     48
2                  AECOM  direct      8
3                    AES  direct      2
4                    AIG  direct      1
..                   ...     ...    ...
328  World Fuel Services  direct      4
329          Xcel Energy  direct      5
330                Xerox  direct      2
331           Yum Brands  direct     10
332                 eBay  direct     31

[333 rows x 3 columns]

In [75]:
pd.read_sql_query(sql='''
SELECT *
FROM(SELECT a.name, w.channel, COUNT(*) count
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
GROUP BY 1, 2
ORDER BY 3 DESC) AS Table1
GROUP BY name
HAVING channel != 'direct';
''', con=conn)

                       name   channel  count
0         AmerisourceBergen  facebook      6
1                      Ball    banner      1
2         Bed Bath & Beyond   organic      7
3   C.H. Robinson Worldwide    banner      1
4                       CBS   adwords      1
5                   Danaher   adwords      1
6           Delta Air Lines   adwords      2
7                 Eli Lilly   adwords      3
8               Exxon Mobil   adwords      1
9              HCA Holdings    banner      2
10               Home Depot   organic     10
11              J.C. Penney   adwords      4
12          Lockheed Martin    banner      1
13                    Loews   adwords      1
14         Tenet Healthcare    banner      6
15                      UPS   adwords      1
16            W.W. Grainger   adwords      1
17         Waste Management   adwords      2

In [104]:
# THE LEAST USED CHANNELS

pd.read_sql_query(sql='''
SELECT channel, COUNT(*) count
FROM(SELECT *
FROM(SELECT a.name, w.channel, COUNT(*) count
FROM web_events w
JOIN accounts a
ON w.account_id = a.id
GROUP BY 1, 2
--ORDER BY 3 DESC) AS Table1
ORDER BY 3) AS Table1
GROUP BY name) AS Table2
GROUP BY 1
ORDER BY 2 DESC;
''', con=conn)

    channel  count
0    banner    106
1   adwords    102
2   twitter     47
3  facebook     38
4    direct     31
5   organic     27